{
  "hello": "Hello",
  "developpeur": "Web Developer",
  "intro": " I am a freelance web developer specializing in front-end web development for the past 5 years. I am passionate about creating beautiful interfaces, UX, and fast websites.",
  "about": {
    "title": "About",
    "text1": "Based in Lille, I have several years of experience in corporate development, which has allowed me to gain a comprehensive understanding of the web industry. ",
    "text2": "My main goal is to provide pleasant user experiences by creating aesthetic and intuitive interfaces. I firmly believe that design and functionality go hand in hand to deliver quality websites.",
    "text3": "Feel free to contact me. I would be delighted to discuss your project and contribute to its success."
  },
  "skills": "Skills",
  "work": {
    "title": "Projects",
    "tag": "Project",
    "intro1": "Throughout my career, I've worked on a variety of projects, some public and some private.",
    "intro2": "Here's a selection of 3 public projects I've been developing lately",

    "presentation": "Introduction",
    "tech": "Technology",
    "techno_utilise": "Tech stack"
  },
  "esurvey": {
    "presentation": "The website presented here is e-survey. It is a platform (available in multiple languages) for automated online survey deployment. With an elegant showcase site, an intuitive creation module, and automated response management, e-survey makes the process fast and accessible.<br /> The main goal of the platform is to simplify online survey creation through a streamlined interface, designed in close collaboration with industry professionals.",
    "technique": "On the project from the initial sketches, I had the opportunity to have a great deal of freedom in making technological choices. My mission was to manage the front-end part of the platform, whether it was the questionnaire or response creation module.<br /> The choice of React was made quickly and unequivocally, as its component-based thinking and organization aligned perfectly with the project.<br /> Subsequently, other challenges arose, requiring us to implement more advanced state management, including Mobx.<br /> Towards the end of the project, I also worked on the back-end to optimize the performance of certain resource-intensive actions."
  },
  "differences": {
    "presentation": "The website presented here is 3Differences. It's a personal creation. Who has never played the game of 7 differences on a piece of paper? <br /> Very well, simple and effective, but what if we added a dimension? That's where the idea came to me to develop a 3D spot the difference game in the form of a website. <br /><br /> The game is simple, a 3D scene with an object with some missing elements, and in the top right corner, another scene with the reference object.",
    "technique": "To implement this concept, I had to turn to Three.js, a WebGL library that makes 3D access in the browser easier. To combine the use of React and Three.js, I used the react-three-fiber library, which encapsulates Three.js functionality in the form of React components."
  },
  "portfolio": {
    "presentation": "The website presented here is my portfolio. It's a personal creation. The idea is to create a clean and minimalistic site containing various information about myself and my projects. I drew inspiration from Apple's product pages, using cards to display the information.",
    "technique": "Simplicity was the key, but a touch of visual appeal was still necessary. That's why the portfolio consists of two sites, the first one being the container, with a floating MacBook displaying the actual content (an iPhone for mobile devices). It was important to me to incorporate 3D into my website because, in my view, this technology offers new possibilities for expression, and the react-three-fiber library was a great help in achieving that."
  },
  "contact": {
    "title": "Let's start a project together. ",
    "nom": "Name",
    "email": "Email",
    "message": "Your message",
    "text": "I have a new project, can we discuss about it ? ",
    "envoyer": "Send",
    "envoye": "Sent!"
  }
}
